# This is the part 2 of Practice 8 Clustering Algorithms
Subject:
Pattern Recognition

Instructions:
1. Download Mall_Custormers.csv
2. Create a market segmentation using some clustering algorithm
3. Calculate the silhouette score, find the best model that makes a good partition
4. Using the partitions found, describe the clustering using desscriptive stadistic.
5. Upload your work in PDF

1. Import the necesary libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

2. Import the dataframe

In [ ]:
# !wget -nc https://raw.githubusercontent.com/Dr-Carlos-Villasenor/PatternRecognition/main/Dataset/Mall_Customers.csv

"wget" no se reconoce como un comando interno o externo,
programa o archivo por lotes ejecutable.

In [6]:
data = pd.read_csv("Mall_Customers.csv")

In [7]:
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

# Preprocessing
I will preprocess the dataframe in the following way:
- Eliminate the ID
- Encode the gender column

In [8]:
df = data.drop(columns=['CustomerID'])

In [9]:
df.head()

   Gender  Age  Annual Income (k$)  Spending Score (1-100)
0    Male   19                  15                      39
1    Male   21                  15                      81
2  Female   20                  16                       6
3  Female   23                  16                      77
4  Female   31                  17                      40

## Encoding Gender

In [11]:
from sklearn.preprocessing import OneHotEncoder

In [14]:
encodedDf = pd.get_dummies(df, columns=['Gender'])

In [15]:
encodedDf

,Age,Annual Income (k$),Spending Score (1-100),Gender_Female,Gender_Male
0,19,15,39,False,True
1,21,15,81,False,True
2,20,16,6,True,False
3,23,16,77,True,False
4,31,17,40,True,False
...,...,...,...,...,...
195,35,120,79,True,False
196,45,126,28,True,False
197,32,126,74,False,True
198,32,137,18,False,True
199,30,137,83,False,True